#### Terraform Plan 📖
<!-- terraform-plan-comment -->
<details><summary>Show Plan</summary>

```terraform
google_monitoring_uptime_check_config.availability["pandoc"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/pandoc-availability-y1tcIMTdvoQ]
google_monitoring_uptime_check_config.availability["houdini"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/houdini-availability--pm76nfsbjw]
google_monitoring_uptime_check_config.availability["crayfits"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/crayfits-availability-7_McV0cG3IU]
google_monitoring_uptime_check_config.availability["homarus"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/homarus-availability--pm76nfsbNM]
google_monitoring_uptime_check_config.availability["ocrpdf"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/ocrpdf-availability-sOY-TXhAvZA]
google_monitoring_uptime_check_config.availability["hypercube"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/hypercube-availability-uj2slOcnzdY]
google_monitoring_uptime_check_config.availability["libreoffice"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/libreoffice-availability-yR9xdWLgolc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.gemma.google_cloud_run_v2_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "cloudrun" {
        id                      = "projects/libops-public-microservices/locations/us-central1/services/gemma"
        name                    = "gemma"
        # (28 unchanged attributes hidden)

      ~ template {
            # (7 unchanged attributes hidden)

          ~ containers {
              ~ image      = "us-docker.pkg.dev/libops-public-microservices/shared/gemma3:main" -> "us-docker.pkg.dev/libops-public-microservices/shared/gemma3-12b:main"
                name       = "gemma"
                # (4 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.gemma-27b.google_cloud_run_v2_service.cloudrun["us-central1"] will be created
  + resource "google_cloud_run_v2_service" "cloudrun" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "BETA"
      + location                = "us-central1"
      + name                    = "gemma-27b"
      + observed_generation     = (known after apply)
      + project                 = "libops-public-microservices"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "cr-microservices@libops-public-microservices.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/libops-public-microservices/shared/gemma3-27b:main"
              + name       = "gemma"

              + env {
                  + name  = "SKIP_JWT_VERIFY"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = false
                  + limits   = {
                      + "cpu"            = "8000m"
                      + "memory"         = "32Gi"
                      + "nvidia.com/gpu" = "1"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }
    }

  # module.gemma-27b.google_cloud_run_v2_service_iam_member.invoker["us-central1"] will be created
  + resource "google_cloud_run_v2_service_iam_member" "invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "gemma-27b"
      + project  = "libops-public-microservices"
      + role     = "roles/run.invoker"
    }

  # module.gemma-27b.google_compute_backend_service.backend[0] will be created
  + resource "google_compute_backend_service" "backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "libops-backend-gemma-27b"
      + port_name                       = (known after apply)
      + project                         = "libops-public-microservices"
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.gemma-27b.google_compute_region_network_endpoint_group.neg["us-central1"] will be created
  + resource "google_compute_region_network_endpoint_group" "neg" {
      + id                    = (known after apply)
      + name                  = "libops-neg-gemma-27b-us-central1"
      + network_endpoint_type = "SERVERLESS"
      + project               = "libops-public-microservices"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "gemma-27b"
        }
    }

  # module.mistral.google_cloud_run_v2_service.cloudrun["us-central1"] will be created
  + resource "google_cloud_run_v2_service" "cloudrun" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "BETA"
      + location                = "us-central1"
      + name                    = "mistral"
      + observed_generation     = (known after apply)
      + project                 = "libops-public-microservices"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "cr-microservices@libops-public-microservices.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/libops-public-microservices/shared/mistral-small-24b:main"
              + name       = "mistral"

              + env {
                  + name  = "SKIP_JWT_VERIFY"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = false
                  + limits   = {
                      + "cpu"            = "8000m"
                      + "memory"         = "32Gi"
                      + "nvidia.com/gpu" = "1"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }
    }

  # module.mistral.google_cloud_run_v2_service_iam_member.invoker["us-central1"] will be created
  + resource "google_cloud_run_v2_service_iam_member" "invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "mistral"
      + project  = "libops-public-microservices"
      + role     = "roles/run.invoker"
    }

  # module.mistral.google_compute_backend_service.backend[0] will be created
  + resource "google_compute_backend_service" "backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "libops-backend-mistral"
      + port_name                       = (known after apply)
      + project                         = "libops-public-microservices"
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.mistral.google_compute_region_network_endpoint_group.neg["us-central1"] will be created
  + resource "google_compute_region_network_endpoint_group" "neg" {
      + id                    = (known after apply)
      + name                  = "libops-neg-mistral-us-central1"
      + network_endpoint_type = "SERVERLESS"
      + project               = "libops-public-microservices"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "mistral"
        }
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>